cshtb/stm32_control/User/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  fire
  * @version V1.0
  * @date    2020-01-7
  * @brief   https://github.com/cshtb/stm32_control.git
  ******************************************************************************

  ******************************************************************************
  */
 
/* Includes ------------------------------------------------------------------*/
#include "./adc/bsp_adc.h"
#include "stm32f4xx.h"
#include "./usart/bsp_debug_usart.h"
#include "./led/bsp_led.h"
#include "./systick/bsp_SysTick.h"
#include "./i2c/i2c.h"
#include "./mpu6050/bsp_mpu_exti.h"
#include "./relay/bsp_relay.h"  
#include "./tim/bsp_advance_tim.h"


//设置是否使用LCD进行显示，不需要的话把这个宏注释掉即可
#define USE_LCD_DISPLAY
#define USE_USART_DISPLAY

#ifdef USE_LCD_DISPLAY
 #include "./lcd/bsp_lcd.h"
#endif

#include "stdio.h"
    
#include "inv_mpu.h"
#include "inv_mpu_dmp_motion_driver.h"
#include "invensense.h"
#include "invensense_adv.h"
#include "eMPL_outputs.h"
#include "mltypes.h"
#include "mpu.h"
#include "log.h"
#include "packet.h"
/* Private typedef -----------------------------------------------------------*/
/* Data read from MPL. */
#define PRINT_ACCEL     (0x01)
#define PRINT_GYRO      (0x02)
#define PRINT_QUAT      (0x04)
#define PRINT_COMPASS   (0x08)
#define PRINT_EULER     (0x10)
#define PRINT_ROT_MAT   (0x20)
#define PRINT_HEADING   (0x40)
#define PRINT_PEDO      (0x80)
#define PRINT_LINEAR_ACCEL (0x100)
#define PRINT_GRAVITY_VECTOR (0x200)

volatile uint32_t hal_timestamp = 0;
#define ACCEL_ON        (0x01)
#define GYRO_ON         (0x02)
#define COMPASS_ON      (0x04)

#define MOTION          (0)
#define NO_MOTION       (1)

/* Starting sampling rate. */
#define DEFAULT_MPU_HZ  (20)

#define FLASH_SIZE      (512)
#define FLASH_MEM_START ((void*)0x1800)

#define PEDO_READ_MS    (1000)
#define TEMP_READ_MS    (500)
#define COMPASS_READ_MS (100)
struct rx_s {
    unsigned char header[3];
    unsigned char cmd;
};
struct hal_s {
    unsigned char lp_accel_mode;
    unsigned char sensors;
    unsigned char dmp_on;
    unsigned char wait_for_tap;
    volatile unsigned char new_gyro;
    unsigned char motion_int_mode;
    unsigned long no_dmp_hz;
    unsigned long next_pedo_ms;
    unsigned long next_temp_ms;
    unsigned long next_compass_ms;
    unsigned int report;
    unsigned short dmp_features;
    struct rx_s rx;
};
static struct hal_s hal = {0};

/* USB RX binary semaphore. Actually, it's just a flag. Not included in struct
 * because it's declared extern elsewhere.
 */
volatile unsigned char rx_new;

unsigned char *mpl_key = (unsigned char*)"eMPL 5.1";

/* Platform-specific information. Kinda like a boardfile. */
struct platform_data_s {
    signed char orientation[9];
};

/* The sensors can be mounted onto the board in any orientation. The mounting
 * matrix seen below tells the MPL how to rotate the raw data from the
 * driver(s).
 * TODO: The following matrices refer to the configuration on internal test
 * boards at Invensense. If needed, please modify the matrices to match the
 * chip-to-body matrix for your particular set up.
 */
static struct platform_data_s gyro_pdata = {
    .orientation = { 1, 0, 0,
                     0, 1, 0,
                     0, 0, 1}
};



#define BYTE0(dwTemp)       (*(char *)(&dwTemp))
#define BYTE1(dwTemp)       (*((char *)(&dwTemp) + 1))
#define BYTE2(dwTemp)       (*((char *)(&dwTemp) + 2))
#define BYTE3(dwTemp)       (*((char *)(&dwTemp) + 3))
	
/**
  * @brief  控制串口发送1个字符
  * @param  c:要发送的字符
  * @retval none
  */
void usart_send_char(uint8_t c)
{
	while(USART_GetFlagStatus(DEBUG_USART,USART_FLAG_TXE)==RESET); //循环发送,直到发送完毕
	USART_SendData(DEBUG_USART,c);
}



extern struct inv_sensor_cal_t sensors;
/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* ---------------------------------------------------------------------------*/
/* Get data from MPL.
 * TODO: Add return values to the inv_get_sensor_type_xxx APIs to differentiate
 * between new and stale data.
 */
static void read_from_mpl(void)
{
    long msg, data[9];
    int8_t accuracy;
    unsigned long timestamp;
    float float_data[3] = {0};		
		
		/********************使用液晶屏显示数据**************************/
    if(1)
    {
				char cStr [ 70 ];
				char cStr_1 [ 70 ];
				char cStr_2 [ 70 ];
				char cStr_3 [ 70 ];
				unsigned long timestamp,step_count,walk_time;

			
				/*获取欧拉角*/
			  if (inv_get_sensor_type_euler(data, &accuracy,(inv_time_t*)&timestamp))
						{
																		
						#ifdef USE_LCD_DISPLAY
									sprintf ( cStr, "Pitch :  %.4f  ", data[0]*1.0/(1<<16) );	//inv_get_sensor_type_euler读出的数据是Q16格式，所以左移16位.
									LCD_DisplayStringLine(LINE(7),(uint8_t* )cStr);			

									
									sprintf ( cStr, "Roll  :  %.4f  ", data[1]*1.0/(1<<16) );	//inv_get_sensor_type_euler读出的数据是Q16格式，所以左移16位.
									LCD_DisplayStringLine(LINE(8),(uint8_t* )cStr);	
									
									sprintf ( cStr, "Yaw   :  %.4f  ", data[2]*1.0/(1<<16) );	//inv_get_sensor_type_euler读出的数据是Q16格式，所以左移16位.
									LCD_DisplayStringLine(LINE(9),(uint8_t* )cStr);	
									
									/*温度*/
									mpu_get_temperature(data,(inv_time_t*)&timestamp); 
									
									sprintf ( cStr_1, "Temperature  :  %.2f  ", data[0]*1.0/(1<<16) );	//inv_get_sensor_type_euler读出的数据是Q16格式，所以左移16位.
									LCD_DisplayStringLine(LINE(10),(uint8_t* )cStr);	
						#endif
							
						#ifdef USE_USART_DISPLAY
									sprintf ( cStr, "Pitch :  %.4f  ", data[0]*1.0/(1<<16) );	//inv_get_sensor_type_euler读出的数据是Q16格式，所以左移16位.
									printf("%s  ",(uint8_t* )cStr);			

									
									sprintf ( cStr, "Roll  :  %.4f  ", data[1]*1.0/(1<<16) );	//inv_get_sensor_type_euler读出的数据是Q16格式，所以左移16位.
									printf("%s  ",(uint8_t* )cStr);			

									
									sprintf ( cStr, "Yaw   :  %.4f  ", data[2]*1.0/(1<<16) );	//inv_get_sensor_type_euler读出的数据是Q16格式，所以左移16位.
									printf("%s  \n",(uint8_t* )cStr);			

									
									/*温度*/
									mpu_get_temperature(data,(inv_time_t*)&timestamp); 
									
									sprintf ( cStr_1, "Temperature  :  %.2f  ", data[0]*1.0/(1<<16) );	//inv_get_sensor_type_euler读出的数据是Q16格式，所以左移16位.
									printf("%s  \n",(uint8_t* )cStr);										
						#endif
						
